benchmark/old_outputs/clock_threads_128/uni_4/2026-04-19T15:39:14-04:00_9_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 4
number of threads: 2
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1310982
number of failed transactions: 0 (0.000%)
latency average = 0.549 ms
initial connection time = 3.183 ms
tps = 7283.349665 (without initial connection time)
SQL script 1: pgscripts/uniform_select.sql
 - weight: 9 (targets 90.0% of total)
 - 1179169 transactions (89.9% of total)
 - number of transactions actually processed: 1179169 (tps = 6551.043524)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.462 ms
 - latency stddev = 0.591 ms
SQL script 2: pgscripts/uniform_update.sql
 - weight: 1 (targets 10.0% of total)
 - 130921 transactions (10.0% of total)
 - number of transactions actually processed: 130921 (tps = 727.350506)
 - number of failed transactions: 0 (0.000%)
 - latency average = 1.323 ms
 - latency stddev = 2.330 ms
ratio: .3424066685778903